<a href="https://colab.research.google.com/github/mohammadJKA/test/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np



def add(x, y):
    """Adds two numbers together."""
    return x + y

def subtract(x, y):
    """Subtracts two numbers."""
    return x - y

def multiply(x, y):
    """Multiplies two numbers."""
    return x * y

def divide(x, y):
    """Divides two numbers.

    Raises:
        ZeroDivisionError: If the divisor is zero.
    """
    if y == 0:
        raise ZeroDivisionError("Cannot divide by zero")
    return x / y

# Get input from the user
num1 = float(input("Enter first number: "))
op = input("Enter operator (+, -, *, /): ")
num2 = float(input("Enter second number: "))
result =0
# Perform the calculation
if op == "+":
    result = add(num1, num2)
elif op == "-":
    result = subtract(num1, num2)
elif op == "*":
    result = multiply(num1, num2)
elif op == "/":
    result = divide(num1, num2)
else:
    print("Invalid operator")

# Print the result
print(f"Result: {result}")

amman
irbid
jarash

# New Section

In [11]:
import numpy as np
import pandas as pd
y=pd.read_csv('/content/sample_data/california_housing_test.csv')
y.describe()
y['total_rooms'].unique()
y['total_rooms'][1:10] # [10:] or [:10] or y[1:10]
#y.shape
#y.head(15)
#y.tail(5)
#pd.DataFrame({'A':[1,2],'B':[3,4]})
#pd.Series([1,2,3,4,5,6])
#random_numbers=np.random.rand(3,2)
#print(random_numbers)

1    1510.0
2    3589.0
3      67.0
4    1241.0
5    1018.0
6    1009.0
7    2310.0
8    3080.0
9    2402.0
Name: total_rooms, dtype: float64